### Name: Abhishek Sahu
### Regs. no: 2241019164
### Section: 07
### Branch: CSE
### Sub: Data Science Workshop-1

In [ ]:
1. Convert the list [’100’, ’200’, ’python’, ’300.12’, ’400’] to a Series object than sort it. The output
should be [’100’, ’200’, ’300.12’, ’400’, ’python’].

In [24]:
import pandas as pd
import numpy as np
x= pd.Series(['100','200','python','300.12','400'])
print(x)
x.sort_values(ascending = True)

0       100
1       200
2    python
3    300.12
4       400
dtype: object

0       100
1       200
3    300.12
4       400
2    python
dtype: object

In [ ]:
2. Write a Pandas program to convert the first column of a DataFrame as a Series.

In [25]:
fr=pd.DataFrame(np.arange(16).reshape(4,4))
fr

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
3. Create a data frame containing names of first five presidents of India, and years served by them. Once
the data frame is created, add another column containing their home state for the first four presidents.

In [29]:
frame=pd.DataFrame({'President':['abhishek','sudeep','subha','hitesh','sid'],'Year':[12,23,45,67,85]})
frame

  President  Year
0  abhishek    12
1    sudeep    23
2     subha    45
3    hitesh    67
4       sid    85

In [30]:
frame1=pd.DataFrame(frame,columns=['Presient','Year','HS'])
frame1['HS']=['xy','yz','zx','ab','bc']
frame1

   Presient  Year  HS
0       NaN    12  xy
1       NaN    23  yz
2       NaN    45  zx
3       NaN    67  ab
4       NaN    85  bc

In [ ]:
4. Convert s1=[1,2,3,4,2] and s2=[3,4,5,6] to two series objects. Find elements in s1, which are not
present in s2.

In [3]:
import pandas as pd 
p1 = pd.Series([1,2,3,4,2]) 
p2 = pd.Series([3,4,5,6])
print("Series1:") 
print(p1) 
print("\nSeries2:") 
print(p2)  
print("\nItems of ps1 not present in ps2:") 
res = p1[~p1.isin(p2)] 
print(res)

Series1:
0    1
1    2
2    3
3    4
4    2
dtype: int64

Series2:
0    3
1    4
2    5
3    6
dtype: int64

Items of ps1 not present in ps2:
0    1
1    2
4    2
dtype: int64

In [ ]:
5. Write a Pandas program to find the index of the first occurrence of the smallest and largest value of a
given series. If the input is [1,1, 3, 7,88, 12, 88, 23, 3, 1, 9, 0], the output should be 0 and 4.

In [67]:
dt = pd.Series([1,1, 3, 7,88, 12, 88, 23, 3, 1, 9, 0])
print('series:',dt)
print('\nmin element index: ',dt.idxmin())
print('max element index: ',dt.idxmax())

series: 0      1
1      1
2      3
3      7
4     88
5     12
6     88
7     23
8      3
9      1
10     9
11     0
dtype: int64

min element index:  11
max element index:  4

In [ ]:
6. Convert L=[’Cry’, ’Apple’, ’Orange’, ’Sky’, ’Banana’] to a pandas series. Create a new series with
the elements which has a vowel. Create another series which starts with a vowel.

In [ ]:
7. Write a Pandas program to calculate the number of characters in each word in a given series.

In [58]:
sr = pd.Series(['Php', 'Python', 'Java', 'C#'])
print("Original Series:")
print(sr)
result = sr.map(lambda x: len(x))
print("\nNumber of characters in each word in the said series:")
print(result)

Original Series:
0       Php
1    Python
2      Java
3        C#
dtype: object

Number of characters in each word in the said series:
0    3
1    6
2    4
3    2
dtype: int64

In [ ]:
8. Create a 4*4 data frame where each entry is from the standard normal distribution. Create another
matrix which is element wise square root of the previous matrix. Find the number of NaN values in
each column. Find the mean and standard deviation of each column.

In [31]:
q8=pd.DataFrame(np.random.standard_normal([4,4]))
q8

          0         1         2         3
0  0.457295  0.644997 -0.822280 -0.214452
1  1.500988  1.519889  1.145121 -1.038823
2 -1.517178  1.396224 -0.963374  0.708049
3  0.435485 -0.702622  1.240834  0.275032

In [34]:
q=pd.DataFrame(np.sqrt(q8))
print(q)
x=q.apply(lambda x: x.isnull().sum(),axis=0)
x

          0         1         2         3
0  0.676236  0.803117       NaN       NaN
1  1.225148  1.232838  1.070103       NaN
2       NaN  1.181619       NaN  0.841457
3  0.659913       NaN  1.113927  0.524435

0    1
1    1
2    2
3    2
dtype: int64

In [36]:
q.mean(axis=0)
q

          0         1         2         3
0  0.676236  0.803117       NaN       NaN
1  1.225148  1.232838  1.070103       NaN
2       NaN  1.181619       NaN  0.841457
3  0.659913       NaN  1.113927  0.524435

In [ ]:
9. Create a 4*4 matrix, where each row contains Student’s name, registration no, sec and cgpa.
D=’Name’:[’A’,”B”,”C”,”D”],’Reg no’:[1,2,3,4], ’Sec’:[’i’,’ii’,’iii’,’iv’],’CGPA’:[7,8,9,10] Find the name,
registration no of the student with highest cgpa.(Use np.max on cgpa column) What is the row and
column number of the cell with the highest CGPA? (Convert dataframe to numpy array and see which
indices has maximum value)

In [41]:
q9=pd.DataFrame({'Name':['A','B','C','D'],'Reg no':[1,2,3,4], 'Sec':['i','ii','iii','iv'],'CGPA':[7,8,9,10]})
q9

  Name  Reg no  Sec  CGPA
0    A       1    i     7
1    B       2   ii     8
2    C       3  iii     9
3    D       4   iv    10

In [ ]:
10. Create a dataframe object, df containing some Nan values. Count the number of missing values in
each column of df. Which column has the maximum number of missing values?(create a function to
count nan values in a column, use df.apply and that function)

In [38]:
df=pd.DataFrame(np.sqrt(np.random.standard_normal([4,4])))
df

/snap/jupyter/6/lib/python3.7/site-packages/ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in sqrt
  """Entry point for launching an IPython kernel.

          0   1         2         3
0  0.865212 NaN       NaN       NaN
1  1.004150 NaN  0.310068  0.144239
2  1.206044 NaN       NaN       NaN
3  0.639020 NaN       NaN       NaN

In [39]:
x=df.apply(lambda x: x.isnull().sum(),axis=0)
x

0    0
1    4
2    3
3    3
dtype: int64

In [ ]:
11. Create a 4*4 matrix, entries from np.arange(16). Reverse the entries of the matrix.

In [51]:
q11=pd.DataFrame(np.arange(16).reshape(4,4))
q11

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [53]:
rev=q11.loc[::-1,::-1]
rev

    3   2   1   0
3  15  14  13  12
2  11  10   9   8
1   7   6   5   4
0   3   2   1   0

In [ ]:
12. Create a 4*4 matrix where each entries are from standard normal distribution. Add a column to this
data frame, which contains row wise minimums.

In [12]:
q12=pd.DataFrame(np.random.standard_normal([4,4]))
rmin=q12.apply(np.min,axis=1)
q12['min']=rmin
q12

          0         1         2         3       min
0 -0.133502  0.196635 -0.420560  0.062358 -0.420560
1 -0.697745  1.029615  0.043083 -0.519791 -0.697745
2 -0.658817 -0.117261  1.753678  1.201243 -0.658817
3 -0.719834 -1.003027  0.306290  1.196422 -1.003027

In [ ]:
13. Create a 4*4 matrix entries from standard normal distribution. Add another row where all entries are
NaN. Replace missing values in ’col1’ and ’col2’ columns with their respective mean.

In [49]:
import numpy as np
q13=pd.DataFrame(np.random.standard_normal([4,4]))
q13=q13.reindex(index=[0,1,2,3,'mean'])
q13

             0         1         2         3
0     0.897624 -0.090346  0.549304  0.020905
1    -0.519414  0.938152  0.630112 -0.346944
2    -0.484607  0.293463  0.024989 -0.526551
3    -0.175834 -0.645942 -0.722216  1.106861
mean       NaN       NaN       NaN       NaN

In [50]:
q131[[0,1]].apply(lambda x:x.fillna(x.mean()))

             0         1
0    -0.322176  1.414078
1     0.136989  0.308397
2    -0.078010  0.423858
3    -0.289972 -1.323670
mean -0.138292  0.205666